var index = 0;
var timer = ""; //定时器
var startCount = 0; //计数器-次数
var outPut =
	"	在吃货的眼中，世界上只有两种东西，一种是能吃的，一种是怎么做才好吃的。致想象无限，技术为民";

/**
 * 初始化方法
 */
$(function() {
	initRead(); //作者寄语
})

/**
 * 作者寄语
 */
function initRead() {
	var readme = storage.getItem("readme");
	if (!StrIsNotEmpt(readme)) {
		timer = setInterval(funmsgNotice, 300);
	}
}

/**
 * 文字逐个出现
 */
function funmsgNotice() {
	$("#show_msg").text(outPut.substring(0, index++));
	var len = outPut.length;

	console.log(len);
	if (len < index) {
		clearInterval(timer);
		$("#show_msg").fadeOut(8000);
	}
	storage.setItem("readme", "0");
}


function btn_start() {
	$("#show_msg").empty(); //清空显示

	if (stopMsg()) {
		return false;
	};

	$("#load_img").show();
	timer = window.setInterval("loadData()", 3000); //三秒后加载数据
}

/**
 * 加载数据
 */
function loadData() {
	window.clearInterval(timer);
	var arr = ["黄金茄酱蛋包饭 ", " 西红柿鸡蛋面 ", " 家常地三鲜 ", " 干锅土豆片 ", " 香焖排骨饭 ", " 鱿鱼土豆泥 ", " 椰香咖喱虾 ", " 黄焖鸡 ", " 辣牛肉汤 ",
		" 秘制红烧肉 ", " 夏日清爽鸡翅根 ", " 麻辣鲜香口水鸡 ", " 黄金鱿鱼圈 ", " 五彩酒窝面 ", " 辣炒花蛤 ", " 韩式部队火锅 ", " 家常牛肉冷面 ", " 麻酱凉面 ", " 豆豉带鱼 ",
		" 辣子鸡 ", " 紫菜包饭&寿司 ", " 芝士爆浆鸡排 ", " 铁板玉子豆腐 ", " 蒜香黄油烤鸡 ", " 章鱼小丸子 ", " 东北溜肉段 ", " 花朵早餐汉堡 ", " 秘制黑鸭 ", " 香辣烤鱼 ",
		" 吐司虾卷 ", " 桂花糯米藕 ", " 泰式冬阴功汤 ", " 土豆泥芝士 ", " 手工零食 ", " 东北锅包肉 ", " 风琴土豆 ", " 酸菜鱼 ", " 铁板黑椒牛肉粒 ", " 单身便当 ",
		" 鸡翅包饭 ", " 虾扯蛋 ", " 菠萝饭 ", " 扁豆焖面 ", " 巧克力泡芙 ", " 照烧鸡腿饭 ", " 鱼香肉丝 ", " 关东煮 ", " 番茄鸡肉焗饭 ", " 咖喱牛腩锅 ", " 健康油条 ",
		" 煎饼果子 ", " 酸辣粉 ", " 香辣卤鸡爪 ", " 拔丝地瓜 ", " 火爆大头菜 ", " 菠萝咕咾肉 ", " 蚝油生菜 ", " 酸笋米粉 ", " 麻婆豆腐 ", " 菜包饭 ", " 酸辣汤 ",
		" 鸡蛋羹 ", " 快手凉皮 ", " 蒜香小土豆 ", " 腐乳肉了 ", " 螺蛳粉 ", " 醋溜娃娃菜 ", " 香煎豆腐 ", " 叉烧肉 ", " 油泼面 ", " 酸汤肥牛", " 烤冷面 ",
		" 辣条蛋炒饭 ", " 西红柿疙瘩汤 ", " 炒方便面 ", " 蔬菜清炒汁 ", " 薯条炸番茄 ", " 麻辣烫 ", " 臭豆腐 ", " 鸭血粉丝汤 ", " 狼牙土豆 ", " 韭菜盒子 ", " 鸡灌饼 ",
		" 麻辣牛肉干 ", " 超级至尊披萨 ", " 重庆鸳鸯火锅 ", " 肉丸胡辣汤 ", " 蒜泥白肉 ", " 茄子北非蛋罗宋汤 ", " 香菇鸡汤 ", " 藤椒鸡 ", " 法式煎饼 ", " 自制拉面 ",
		" 芝士虾丸 ", " 十三香小龙虾 ", " 辣炒小海鲜 ", " 什锦肉大拼盘 ", " 烤鸭 ", " 酸辣凤爪 ", " 木炭烤肉 ", " 自制热干面 ", " 蚵仔煎 ", " 干煸肥肠 ", " 烟熏虎皮虾 ",
		" 自制烤腿肉 ", " 蒜蓉开背虾 ", " 炸鸡披萨chizza ", " 水煮牛肉 ", " 生滚鱼片 ", " 快手焗海鲜 ", " 低温慢煮羊排 ", " 下酒菜 ", " 螺蛳粉 ", " 香煎鲈鱼 ",
		" 鸡丝凉面 ", " 钵钵鸡 ", " 女巫汤意面 ", " 小龙虾披萨 ", " 红油抄手 ", " 意大利手工面 ", " 爆炒酱香蛏子  ", " 粉丝海鲜煲  ", " 西班牙海鲜饭 ", " 愤怒的汉堡 ",
		" 酸汤水饺", " 干煸豆角 ", " 法式香煎鹅肝 ", " 鳗鱼饭 ", "香辣猪蹄 ", " 快手炒面 ", " 回锅肉  ", " 驴肉火烧 ", " 肉末豆腐 ", " 三汁焖锅 ", " 手撕包菜  ",
		" 金瓜牛腩  ", " 麻辣双脆  ", " 鸡公煲  ", " 麻辣鸭舌  ", " 猪肉炖粉条  ", " 妮妮兔迷你煎饺  ", " 剁椒蒸鱼  ", " 牛排大餐  ", " 香辣酥鸡脆骨  ", " 水煮鱼 ",
		" 酸汤肥牛 ", " 干锅牛蛙 ", " 鸭血粉丝汤 ", " 厚蛋烧 ", " 热红酒 ", "圣诞大餐 ", " 藜麦饭 ", " 自制辣条 ", "鲫鱼汤 ", "白酒花蛤 ", "蒜蓉西蓝花 ", "椒麻鸡肉 ",
		"手撕包菜 ", "羊蝎子 ", "土豆玉米排骨汤", "宜宾燃面 ", "草莓酱 ", "荷香牛肋条 ", "金汤肥牛", "五花肉烧梭子蟹 ", "小鸡蘑菇汤", "番茄龙利鱼 ", "麻辣牙签肉 ", "防脱发套餐 ",
		"双薯汤 ", "生煎 ", "剁椒酱", "春节小食", "冰糖葫芦", "红豆春卷", "双色豆腐", "红包蛋糕", "柴犬屁屁面包", "麻辣鱼块", "爱丽丝梦游仙境下午茶", "香辣蛏子", "牛奶土豆泥",
		"糖醋鱼", "小炒牛肉", "沙琪玛", "芋圆糖水", "萝卜羊肉汤", "炸酱面", "外婆面鱼", "卤味", "臭豆腐", "1粒米寿司", "脏脏包", "冬瓜丸子汤", "炒河粉", "没有馅的汤圆",
		"粗10倍泡面", "鲜虾炒面", "不流心蛋包饭", "重庆小面", "疙瘩汤", "黄焖鸡面", "玫瑰茶", "小猪佩奇社会人手表", "爆米花", "大晨子饭团", "油炸冰淇淋", "海草舞饭团",
		"公路厨房虹鳟鱼", "开胃凉菜", " 第五人格杰克", " 老干妈烤肉", "电饭煲三汁焖锅", "水晶蒸饺", "世界杯同款小汉堡", "菠萝饭", "红烧肉 ", "清蒸鲈鱼 ", "一个大的苹果 ", "自行车 ",
		"梅菜扣肉 ", "红烧排骨 ", "蒸蛋 ", "拖拉机 ", "苹果 "
	]
	$("#show_msg").show();
	var index = Math.floor((Math.random() * arr.length));
	$("#show_msg").text(arr[index]);
	$("#load_img").hide();
}

/**
 * 防止刷屏
 */
function stopMsg() {
	var flag = false;
	startCount += 1; //使用次数
	if (startCount % 5 == 0) {
		$("#show_msg").text("你就是刷着玩的对吧 ~_~！");
		flag = true;
	}
	return flag;
}
